{
  "title": "Court Lady ",
  "status": 0,
  "releasedstatus": "2021-04-15",
  "description": [
    "Born into privilege as the son of one of the founding pillars of the Tang Empire, Sheng Chu Mo has never had any desire to do more than enjoying the ease of his own life. With no aspirations, no direction, and no ambition, his life was one of idleness and frivolity but all that changed the day he first laid eyes on Fu Rou. The daughter of a local merchant, Fu Rou never imagined she would be one to inspire greatness in anyone, but when she meets Sheng Chu Mo for the first time, that’s exactly what happens. Instantly enamored by the far superior Fu Rou, Chu Mo is suddenly aware of his own shortcomings and vows to make himself worthy of Fu Rou’s love. Dedicating himself to his studies, Chu Mo grows in knowledge and maturity, hoping that someday he will be worthy enough to ask for Fu Ruo's hand in marriage.",
    "As time passes, he finds himself following in his father’s footsteps, volunteering to selflessly serve the country by defending the coast against a band of marauding pirates. While Chu Mo’s journey towards greatness sets him down one path, Fu Rou sets out on another. Leaving her family to become a master weaver in the royal palace, she soon finds herself entangled in palace schemes that could put not only herself but her entire family, in danger. Walking paths that don’t often cross, Chu Mo and Fu Rou must rely solely on their wits and skill to overcome the ever-growing number of enemies and obstacles that stand in their way. With so much opposition before them, do these two destined souls have what it takes to save their country and their love?",
    "(Source: Viki)"
  ],
  "banner": {
    "high": "../../assets/img/banner/high/banner12.webp",
    "medium": "../../assets/img/banner/medium/banner12.webp",
    "low": "../../assets/img/banner/low/banner12.webp"
  },
  "cardimages": ["/img/card/card12.webp", "/img/card/card12a.webp"],
  "images": [
    "../../assets/img/card/card12.webp",
    "../../assets/img/card/card12a.webp"
  ],
  "rating": "8.0",
  "isBanner": true,
  "type": 0,
  "episodes": 55,
  "role": "Main Role",
  "watchlinks": [
    {
      "name": "Kisskh",
      "img": "../../assets/img/platform/kisskh.webp",
      "link": "https://kisskh.co/Drama/Court-Lady--2021-?id=1562&q=true"
    },
    {
      "name": "Viki",
      "img": "../../assets/img/platform/viki.webp",
      "link": "https://www.viki.com/tv/36555c-court-lady"
    },
    {
      "name": "iQIYI",
      "img": "../../assets/img/platform/iqyi.webp",
      "link": "https://www.iq.com/play/2cvwuqbsdug?&lang=id_id&sh_pltf=4"
    },
    {
      "name": "PrimeVideo",
      "img": "../../assets/img/platform/prime.webp",
      "link": "https://www.amazon.com/Court-Lady/dp/B09CLMVNWC"
    },
    {
      "name": "YouTube",
      "img": "../../assets/img/platform/ytb.webp",
      "link": "https://www.youtube.com/playlist?list=PLhnjbkseqMETX-S9_8U6Q7grLZKRKlytZ"
    }
  ],
  "casts": [
    {
      "name": "Bai Lu",
      "role": "Li Xue"
    },
    {
      "name": "Chen Xingxu",
      "role": "Zhou Zishu"
    },
    {
      "name": "U Kai",
      "role": "Main Lead"
    }
  ]
}
