{
  "title": "She and Her Perfect Husband",
  "useStatus": 0,
  "releasedstatus": "2022-11-22",
  "description": [
    "Single female lawyer Qin Shi is focused on her career, but was rushed into marriage by her parents. The top lawyer firm, Cheng & Hui is recruiting lawyers specializing in family affairs, and one of the requirements is to be married. Qin Wenyu, Qin Shi's second brother who is also a headhunter, secretly changed Qin Shi's marriage status to 'married' without her permission, thus creating a fictional husband for her out of nowhere. Not knowing anything, Qin Shi was employed. Her outstanding performance earned the approval of the founder, Lao Jin. During a gathering with partners, Lao Jin recommended Qin Shi to be a legal counsel for the Association of Women Entrepreneurs. It is only then Qin Shi realizes that she is 'married'. Qin Shi decides to clarify the situation to Lao Jin, but at this moment her 'husband' Yang Hua appears. He was forced by his mother to come for a matchmaking session with Qin Shi's competitor. Feeling angry about his mother's forceful actions, he has no choice but to seek the help of Qin Shi. Thus, the two people who are unwilling to be forced into marriage, hit it off immediately, and impulsively decide to register their marriage. However both their parents sense something wrong with the situation. At this moment, Qin Shi's ex-boyfriend suddenly joined the law firm. Facing the numerous crisis, Qin Shi and Yang Hua begin to slowly feelings for each other, and accidentally acquire true love.",
    "(source: WeTV)"
  ],
  "banner": {
    "high": "../../assets/img/banner/high/banner5.webp",
    "medium": "../../assets/img/banner/medium/banner5.webp",
    "low": "../../assets/img/banner/low/banner5.webp"
  },
  "cardimages": ["/img/card/card5.webp", "/img/card/card5a.webp"],
  "images": [
    "../../assets/img/card/card5.webp",
    "../../assets/img/card/card5a.webp"
  ],
  "rating": "7.9",
  "isBanner": true,
  "type": 0,
  "episodes": 40,
  "role": "",
  "watchlinks": [
    {
      "name": "Watch on Viki",
      "link": "https://www.viki.com/tv/36856c-the-legends"
    },
    {
      "name": "Watch on iQIYI",
      "link": "https://www.iq.com/play/20r8y1j98k"
    }
  ],
  "casts": [
    {
      "name": "Bai Lu",
      "role": "Li Xue"
    },
    {
      "name": "Chen Xingxu",
      "role": "Zhou Zishu"
    },
    {
      "name": "U Kai",
      "role": "Main Lead"
    }
  ]
}
