{
  "title": "Arsenal Military Academy",
  "useStatus": 0,
  "releasedstatus": "2019-08-06",
  "description": [
    "In the early years of the 20th century, Chinese military forces find themselves locked in a drawn-out, bloody conflict as they fight back again the Imperial Japanese army.",
    "The government drafts young male conscripts to defend the besieged northeast of the country – but a woman named Xie Xiang also wants in on the action. She decides to cut her hair short and assume her brother’s identity in a bid to join the Chinese army. Xie Xiang quickly proves herself more than capable in soldiery, and soon wins herself a place in an elite military academy in Shanghai.",
    "At the academy, she befriends a number of young male recruits, including quarrelsome rich kid Gu Yan Zheng and the gentle and introverted Shen Jun San. As the recruits begin to hone their skills, they grow in confidence – and decide to take measures of their own in an attempt to foil the invading forces.",
    "But their struggle becomes more complicated when both Gu Yan Zheng and Shen Jun San begin to develop feelings for Xie Xiang. Will the comrades-in-arms survive the bitter ravages of military conflict? Will love derail Xie Xiang’s quest for justice? And will all really prove fair in love and war?",
    "(Source: Viki)"
  ],
  "banner": {
    "high": "../../assets/img/banner/high/banner6.webp",
    "medium": "../../assets/img/banner/medium/banner6.webp",
    "low": "../../assets/img/banner/low/banner6.webp"
  },
  "cardimages": ["/img/card/card6.webp", "/img/card/card6a.webp"],
  "images": [
    "../../assets/img/card/card6.webp",
    "../../assets/img/card/card6a.webp"
  ],

  "rating": "8.5",
  "isBanner": true,
  "type": 0,
  "episodes": 48,
  "role": "",
  "watchlinks": [
    {
      "name": "Watch on Viki",
      "link": "https://www.viki.com/tv/36856c-the-legends"
    },
    {
      "name": "Watch on iQIYI",
      "link": "https://www.iq.com/play/20r8y1j98k"
    }
  ],
  "casts": [
    {
      "name": "Bai Lu",
      "role": "Li Xue"
    },
    {
      "name": "Chen Xingxu",
      "role": "Zhou Zishu"
    },
    {
      "name": "U Kai",
      "role": "Main Lead"
    }
  ]
}
