{
  "title": "Falling into Your Smile (Movie) ",
  "useStatus": 0,
  "releasedstatus": "2022-03-30",
  "description": [
    "In the ultra-competitive world of e-sports, the all-male ZGDX OPL team is second to none. Armies of adoring female fans follow the team wherever it goes. But when one of the team’s star players suffers a hand injury, the tall, handsome, and notoriously hard-to-please ZGDX captain Lu Si Cheng will not be rushed into choosing a replacement.",
    "The petite, lollipop-loving Tong Yao, meanwhile, is a budding amateur gamer – obsessed with OPL. Her skills are exceptional, but she is of the firm belief that in the male-dominated world of pro gaming, love is a big no-no – even though her own ex-boyfriend was a gamer. When the ZGDX team manager learns of her skills, he contacts her, thinking that recruiting her as the scene’s first female player will help score a major PR coup. Lu Si Cheng is dismissive of her initially, but eventually agrees to accept her as a substitute – a move that polarizes the team’s fanbase. But as they start to get to know one another better, could a closer bond begin to form between them?",
    "(Source: Viki)"
  ],
  "banner": {
    "high": "../../assets/img/banner/high/banner16.webp",
    "medium": "../../assets/img/banner/medium/banner16.webp",
    "low": "../../assets/img/banner/low/banner16.webp"
  },
  "cardimages": ["/img/card/card10.webp", "/img/card/card10a.webp"],
  "images": ["../../assets/img/card/movie/m03.webp"],
  "rating": "7.9",
  "isBanner": false,
  "type": 1,
  "episodes": 1,
  "role": "Main Role",
  "watchlinks": [
    {
      "name": "Watch on Viki",
      "link": "https://www.viki.com/tv/36856c-the-legends"
    },
    {
      "name": "Watch on iQIYI",
      "link": "https://www.iq.com/play/20r8y1j98k"
    }
  ],
  "casts": [
    {
      "name": "Bai Lu",
      "role": "Li Xue"
    },
    {
      "name": "Chen Xingxu",
      "role": "Zhou Zishu"
    },
    {
      "name": "U Kai",
      "role": "Main Lead"
    }
  ]
}
